{
  "add_bias_fnn": false,
  "architectures": [
    "EsmModel"
  ],
  "attention_probs_dropout_prob": 0.0,
  "auto_map": {
    "AutoConfig": "esm_config.EsmConfig",
    "AutoModelForMaskedLM": "modeling_esm.EsmForMaskedLM",
    "AutoModelForSequenceClassification": "modeling_esm.EsmForSequenceClassification",
    "AutoModelForTokenClassification": "modeling_esm.EsmForTokenClassification"
  },
  "dtype": "float32",
  "emb_layer_norm_before": false,
  "esmfold_config": null,
  "hidden_dropout_prob": 0.0,
  "hidden_size": 768,
  "initializer_range": 0.02,
  "intermediate_size": 3072,
  "is_folding_model": false,
  "layer_norm_eps": 1e-12,
  "mask_token_id": 2,
  "max_position_embeddings": 2050,
  "model_type": "esm",
  "num_attention_heads": 16,
  "num_hidden_layers": 24,
  "output_attentions": true,
  "pad_token_id": 1,
  "position_embedding_type": "rotary",
  "tie_word_embeddings": false,
  "token_dropout": false,
  "transformers_version": "4.57.3",
  "use_cache": false,
  "vocab_list": null,
  "vocab_size": 4107
}
